--Таблица, к которой будут производиться запросы выглядит следующим образом:

/*+---------+---------------+-----------------+----------+------------+------------+
  | trip_id | name          | city            | per_diem | date_first | date_last  |
  +---------+---------------+-----------------+----------+------------+------------+
  | 1       | Баранов П.Е.  | Москва          | 700.00   | 2020-01-12 | 2020-01-17 |
  | 2       | Абрамова К.А. | Владивосток     | 450.00   | 2020-01-14 | 2020-01-27 |
  | 3       | Семенов И.В.  | Москва          | 700.00   | 2020-01-23 | 2020-01-31 |
  | 4       | Ильиных Г.Р.  | Владивосток     | 450.00   | 2020-01-12 | 2020-02-02 |
  | 5       | Колесов С.П.  | Москва          | 700.00   | 2020-02-01 | 2020-02-06 |
  | 6       | Баранов П.Е.  | Москва          | 700.00   | 2020-02-14 | 2020-02-22 |
                            ...
  | 19      | Абрамова К.А. | Владивосток     | 450.00   | 2020-07-02 | 2020-07-13 |
  | 20      | Баранов П.Е.  | Воронеж         | 450.00   | 2020-07-19 | 2020-07-25 |
  +---------+---------------+-----------------+----------+------------+------------+*/

/*Задание 1: Вывести из таблицы trip информацию о командировках тех сотрудников, фамилия которых заканчивается на букву «а»,
в отсортированном по убыванию даты последнего дня командировки виде. В результат включить столбцы name, city, per_diem, date_first, date_last.*/
--Запрос:
  SELECT name, city, per_diem, date_first, date_last
  FROM trip
  WHERE name LIKE '%а %'
  ORDER BY date_last DESC
  ;
